Revit 2027 API
StructuralSectionGeneralCEx.LipLength Property
 Lip segment length.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double LipLength { get; set; }
Public Property LipLength As Double
	Get
	Set
public:
property double LipLength {
	double get ();
	void set (double value);
}
member LipLength : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionGeneralCEx Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace